# Pandas Functionality, Time-Series 

In this unit, we'll have a deeper look into how we can view, query, and combine our data in Pandas.  These methods will be important for us when it comes to viewing and cleaning data, as well as creating new columns or even entire data sets from existing ones.<br>
Then we'll look at how to deal with data that is indexed by timestamp, including creating custom datetime indices, resampling times, changing time-zones, and omitting certain dates or times (e.g.: cutting out weekends).  Examples of these include monthly sales numbers for a business, daily temperatures, financial instrument prices, yearly population evolution, etc.  Because this data is not static, there are extra considerations we will have to make when it comes to cleaning, as well as model validation.

## Pandas

We've learned some basic tools for Pandas, including dataframe creation, slicing, and top/bottom viewing.  In this lesson, we'll learn more precise tools for indexing and selecting, slicing, querying, combining, and more.  The first step, as usual, is to import the relevant packages.

In [1]:
import numpy as np
import pandas as pd

We'll start by creating a dataframe of random integers (from 0 to 100), 20 rows by 5 columns.  This will be test data that we can play around with.  We'll have the indices be lowercase letters, and the column names be First, Second, etc.  We will use this as our example dataframe for a lot of the initial learning we'll do in this unit.  As a note, if you run the code in this section for a second time, the numbers in ```df``` will change (because they're randomly selected), so your results will be different.

In [107]:
np.random.seed(100)
df = pd.DataFrame(np.random.randint(0,100,size=(20, 5)), columns=['First','Second','Third','Fourth','Fifth'],
                  index=list('abcdefghijklmnopqrst'))
# Question: how did we shorten our work for the index?
df

   First  Second  Third  Fourth  Fifth
a      8      24     67      87     79
b     48      10     94      52     98
c     53      66     98      14     34
d     24      15     60      58     16
e      9      93     86       2     27
f      4      31      1      13     83
g      4      91     59      67      7
h     49      47     65      61     14
i     55      71     80       2     94
j     19      98     63      53     27
k     56      30     48      47     39
l     38      44     18      64     56
m     34      53     74      17     72
n     13      30     17      53     68
o     50      91     91      83     53
p     78       0     13      57     76
q      3      70      3      84     79
r     10      87     60       3     48
s     52      43     36       5     71
t     38      86     94      98     42

### Information, Indexing & Slicing

One of the easiest ways to get an overview of our data is to use the ```df.describe``` command, which will give us a number of statistics about our data:

In [8]:
df.describe()

           First     Second      Third    Fourth      Fifth
count  20.000000  20.000000  20.000000  20.00000  20.000000
mean   32.250000  54.000000  56.350000  46.00000  54.150000
std    22.475425  30.968575  31.688077  31.57614  27.568623
min     3.000000   0.000000   1.000000   2.00000   7.000000
25%     9.750000  30.000000  31.500000  13.75000  32.250000
50%    36.000000  50.000000  61.500000  53.00000  54.500000
75%    50.500000  86.250000  81.500000  64.75000  76.750000
max    78.000000  98.000000  98.000000  98.00000  98.000000

We can also call its length (number of rows) with the ```len()``` function, like a list or string:

In [9]:
len(df)

20

We can also call some mathematical functions on the columns, to find the sum, mean, etc. (we will see more functions in the next unit).

In [10]:
df['Third'].sum()

1127

We recall we can slice rows by index ```df[ix1:ix2]```, call individual columns ```df['A']```, a group of columns, ```df[['A','C','D']]```, and check the top $n$ items with ```df.head(n)``` and bottom with ```df.tail(n)```.  <br>
(Note:  when the output is large, we can click on the rectangle where ```Out[]:``` is contained to make it smaller)

In [11]:
df[['Second','Third']]

   Second  Third
a      24     67
b      10     94
c      66     98
d      15     60
e      93     86
f      31      1
g      91     59
h      47     65
i      71     80
j      98     63
k      30     48
l      44     18
m      53     74
n      30     17
o      91     91
p       0     13
q      70      3
r      87     60
s      43     36
t      86     94

In [106]:
df['a':'i']

KeyError: 'a'

(This slice was by *label*, not integer index; what do you notice about the beginning/end of this slice?)

For more advanced selection by index and column, we use the .loc[] command.  The common format is ```df.loc[ rows, columns]```
where the rows and columns can be sliced or given as lists.  For example, if we wanted to take our dataframe, and slice out rows 'a' to 'f' for columns 'First' and 'Fifth' only, we would write:

In [13]:
df.loc['a':'f',['First','Fifth']]

   First  Fifth
a      8     79
b     48     98
c     53     34
d     24     16
e      9     27
f      4     83

We could slice along both; taking rows `a` through `f` and the first three columns:

In [14]:
df.loc['a':'f','First':'Third']

   First  Second  Third
a      8      24     67
b     48      10     94
c     53      66     98
d     24      15     60
e      9      93     86
f      4      31      1

If we wanted the value of an individual item, there are a number of ways we can access it.  If we use the above syntax to slice along the same row for a single column (e.g.: row 'a', column 'First'), we get:

In [15]:
df.loc['a':'a','First']

a    8
Name: First, dtype: int64

This visually displays the information, but the format looks a bit weird.  Let's check what the type is:

In [16]:
type(df.loc['a':'a','First'])

pandas.core.series.Series

We can see this outputs a Series object.  If wanted just the value (say, to assign to a variable), we can use ```.loc[row,column]```:

In [17]:
df.loc['a','First']

8

Even though we have row labels, we can still access values with integer index numbering by refering to the index object of the dataframe:

In [18]:
df.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n',
       'o', 'p', 'q', 'r', 's', 't'],
      dtype='object')

In [19]:
df.loc[df.index[0],'First']

8

If we knew a row label, but wanted to know what its integer index is, we can use the ```.index.get_loc(label)```:

In [20]:
df.index.get_loc('a')

0

We can access a list of the column names with:

In [21]:
df.columns

Index(['First', 'Second', 'Third', 'Fourth', 'Fifth'], dtype='object')

and we can access its values as we would a normal list:

In [22]:
df.columns[0]

'First'

In [23]:
df.columns[::2]

Index(['First', 'Third', 'Fifth'], dtype='object')

As an exercise, let's consider the following dataframe:

In [24]:
health_dict = { 'Height':[5.04,5.11,5.09,4.11,5.07], 'Weight':[125,160,131,98,195],'Age':[76,34,28,54,42]}
df_ex = pd.DataFrame(health_dict,index=['Irene','Bertrand','Constance','Agatha','Wilberforce'])
df_ex

             Height  Weight  Age
Irene          5.04     125   76
Bertrand       5.11     160   34
Constance      5.09     131   28
Agatha         4.11      98   54
Wilberforce    5.07     195   42

How would we query the age and weight of the Irene, Bertrand, and Constance?

In [29]:
df_ex.loc[['Irene', 'Bertrand','Constance'], ['Age', 'Weight']]

           Age  Weight
Irene       76     125
Bertrand    34     160
Constance   28     131

How could we query the age and height of the first and third rows only?

In [33]:
df_ex.loc[[df_ex.index[0], df_ex.index[2]], ['Age', 'Height']]

           Age  Height
Irene       76    5.04
Constance   28    5.09

## Dataframe Concatenation

Just like with strings, we can concatenate dataframes together to create larger dataframes.  The difference is that we have an extra dimension to consider: do we want to concatenate along the rows, or along the columns?  Let's make two small dataframes to work with

In [35]:
dc1 = pd.DataFrame({'a':['a0','a1'],'b':['b0','b1']},index=[0,1])
dc2 = pd.DataFrame({'a':['a2','a3'],'b':['b2','b3']},index=[2,3])

dc1

    a   b
0  a0  b0
1  a1  b1

In [36]:
dc2

    a   b
2  a2  b2
3  a3  b3

To concatenate these dataframes, we use the function ```pd.concat()```, and we pass the function a *list* of dataframes that we want to concatenate (the order of the list is the order that they will be combined).  We also need to tell it the axis we want to concatenate along.  Concatenating along rows is ```axis=0```, and is the default.  Concatenating along the columns is ```axis=1```.

In [37]:
pd.concat([dc1,dc2])

    a   b
0  a0  b0
1  a1  b1
2  a2  b2
3  a3  b3

In [38]:
pd.concat([dc1,dc2],axis=1)

     a    b    a    b
0   a0   b0  NaN  NaN
1   a1   b1  NaN  NaN
2  NaN  NaN   a2   b2
3  NaN  NaN   a3   b3

If we change the order:

In [39]:
pd.concat([dc2,dc1],axis=1)

     a    b    a    b
0  NaN  NaN   a0   b0
1  NaN  NaN   a1   b1
2   a2   b2  NaN  NaN
3   a3   b3  NaN  NaN

We can also concatenate using `.append()`.  **Note**:  like the `.concat()` method, this returns a copy, and does not modify the original.

In [44]:
dc1.append(dc2)

    a   b
0  a0  b0
1  a1  b1
2  a2  b2
3  a3  b3

Consider the following two dataframes:

In [45]:
dc3 = pd.DataFrame({'a':['a0','a1'],'b':['b0','b1']},index=[0,1])
dc4 = pd.DataFrame({'a':['a2','a3'],'b':['b2','b3']},index=[1,2])

dc3

    a   b
0  a0  b0
1  a1  b1

In [46]:
dc4

    a   b
1  a2  b2
2  a3  b3

They share a common index.  What happens to the index when we concatenate these two dataframes along rows?

In [48]:
pd.concat([dc3,dc4]).reset_index(drop=True)

    a   b
0  a0  b0
1  a1  b1
2  a2  b2
3  a3  b3

How could we fix this?

In [49]:
pd.concat([dc3, dc4], axis=0)

    a   b
0  a0  b0
1  a1  b1
1  a2  b2
2  a3  b3

Since they share a common index element, if we concatenate along columns, we have two options.  The default option we've seen is an *outer* join, where no information is lost:

In [50]:
pd.concat([dc3,dc4],axis=1)

     a    b    a    b
0   a0   b0  NaN  NaN
1   a1   b1   a2   b2
2  NaN  NaN   a3   b3

We could also perform an *inner* join, which will only keep the rows with a common index:

In [51]:
pd.concat([dc3,dc4],axis=1,join='inner')

    a   b   a   b
1  a1  b1  a2  b2

We can also perform a slightly more complicated join, where we can specify which dataframe's index to use in the final version.  For example, if we `axis=1` concatenate `dc3` and `dc4`, and specify to use `dc3`'s index, we get:

In [52]:
pd.concat([dc3,dc4],axis=1,join_axes=[dc3.index])

    a   b    a    b
0  a0  b0  NaN  NaN
1  a1  b1   a2   b2

#### Keys

If we wanted to concatenate a number of dataframes, but also keep track of the individual pieces, we could assign *keys* to the data frames.  For example:

In [53]:
pd.concat([dc1,dc2],keys=['x','y'])

      a   b
x 0  a0  b0
  1  a1  b1
y 2  a2  b2
  3  a3  b3

If we assign this concatenation to a variable name, we can then pull the individual keys any time we need:

In [54]:
together = pd.concat([dc1,dc2],keys=['x','y'])
together

      a   b
x 0  a0  b0
  1  a1  b1
y 2  a2  b2
  3  a3  b3

The `.loc[]` command will give us the keyed sections:

In [55]:
together.loc['x']

    a   b
0  a0  b0
1  a1  b1

Adding these keys turns the index of the dataframe into a *multiindex*, giving more than one layer of indexing.

In [56]:
together.index

MultiIndex(levels=[['x', 'y'], [0, 1, 2, 3]],
           labels=[[0, 0, 1, 1], [0, 1, 2, 3]])

In [57]:
together.loc[('x',1)]

a    a1
b    b1
Name: (x, 1), dtype: object

This provides us with a (potentially more complicated) way to get around concatenating with repeated indices.  With our example of `[dc3,dc4]` above, we wouldn't have to do any re-indexing on the original indices:

In [58]:
pd.concat([dc3,dc4],axis=0,keys=['x','y'])

      a   b
x 0  a0  b0
  1  a1  b1
y 1  a2  b2
  2  a3  b3

This way, the two indices with `1` are clearly delineated by their respective keys.

As a note, pulling the keyed sections with `.loc[]` and making adjustments to them will not result in the original dataframe changing:

In [59]:
together.loc['x'] + 'g'

     a    b
0  a0g  b0g
1  a1g  b1g

In [60]:
together

      a   b
x 0  a0  b0
  1  a1  b1
y 2  a2  b2
  3  a3  b3

### Querying data with conditions, adjusting data.

All of the selection we've done up until this point has been by row or column label.  What if we wanted to find out what parts of our data set satisfy a specific condition?  There are a number of ways to do this, that yield different-looking results:
1. Using the syntax ```df[conditions]```, Pandas will return a subset of the dataframe that matches the condition given.
2. Using the ```.where()``` command, Pandas will return an object the same dimensions as the original, but will fill in everything that doesn't fit the criteria with a value of your choice.

To begin with, let's find all rows where the values of ```'Seconds'``` are greater than 50.

In [61]:
df[df['Second']>50]

   First  Second  Third  Fourth  Fifth
c     53      66     98      14     34
e      9      93     86       2     27
g      4      91     59      67      7
i     55      71     80       2     94
j     19      98     63      53     27
m     34      53     74      17     72
o     50      91     91      83     53
q      3      70      3      84     79
r     10      87     60       3     48
t     38      86     94      98     42

We notice that this returns all of the columns for the rows that satisfy the criterion on ```df['Second']```.  How do you think we would call *just* the data from 'Second'?

This produces a Series object.  How would we get it to return a Dataframe?

We can combine multiple conditions, but we have to be careful with the syntax.  We cannot use the ```and,or``` as words, but must use the symbols ```&,|```.  Also, we must wrap each condition in parentheses, so Pandas knows where to parse their beginnings and endings.

In [62]:
df[(df['Second']>50) & (df['Fourth']<20)]

   First  Second  Third  Fourth  Fifth
c     53      66     98      14     34
e      9      93     86       2     27
i     55      71     80       2     94
m     34      53     74      17     72
r     10      87     60       3     48

We get error messages without parentheses:

In [ ]:
df[df['Second']>50 & df['Fourth']<20]

How would we query the values from the column `Fourth` corresponding to the rows where the values in `First` are either bigger than 75 or smaller than 20?

In [71]:
condition1 = df["First"] > 75
condition2 = df["First"] < 20
final_condition = condition1 | condition2
condition4 = df.loc[final_condition, "Fourth"]

Another option for querying is using Pandas' ```.where()``` command.  It has the syntax<br>
``` df.where(condition, what to fill with where condition is false)```<br>
If you do not put a "what to fill" value in, it will default to replacing the False values of the condition to np.NaN.  Using the same example as above, finding where ```df['Second']``` is greater than 50:

In [108]:
df.where(df['Second']>50)

   First  Second  Third  Fourth  Fifth
a    NaN     NaN    NaN     NaN    NaN
b    NaN     NaN    NaN     NaN    NaN
c   53.0    66.0   98.0    14.0   34.0
d    NaN     NaN    NaN     NaN    NaN
e    9.0    93.0   86.0     2.0   27.0
f    NaN     NaN    NaN     NaN    NaN
g    4.0    91.0   59.0    67.0    7.0
h    NaN     NaN    NaN     NaN    NaN
i   55.0    71.0   80.0     2.0   94.0
j   19.0    98.0   63.0    53.0   27.0
k    NaN     NaN    NaN     NaN    NaN
l    NaN     NaN    NaN     NaN    NaN
m   34.0    53.0   74.0    17.0   72.0
n    NaN     NaN    NaN     NaN    NaN
o   50.0    91.0   91.0    83.0   53.0
p    NaN     NaN    NaN     NaN    NaN
q    3.0    70.0    3.0    84.0   79.0
r   10.0    87.0   60.0     3.0   48.0
s    NaN     NaN    NaN     NaN    NaN
t   38.0    86.0   94.0    98.0   42.0

If we wanted to make this cleaner looking, we could tell Pandas to replace everything that doesn't satisfy the condition with a 0, or even just an empty string.

In [109]:
df.where(df['Second']>50,'')

  First Second Third Fourth Fifth
a
b
c    53     66    98     14    34
d
e     9     93    86      2    27
f
g     4     91    59     67     7
h
i    55     71    80      2    94
j    19     98    63     53    27
k
l
m    34     53    74     17    72
n
o    50     91    91     83    53
p
q     3     70     3     84    79
r    10     87    60      3    48
s
t    38     86    94     98    42

It's important to note that this does *not* change the original dataframe, which we can confirm by calling it:

In [75]:
df

   First  Second  Third  Fourth  Fifth
a      8      24     67      87     79
b     48      10     94      52     98
c     53      66     98      14     34
d     24      15     60      58     16
e      9      93     86       2     27
f      4      31      1      13     83
g      4      91     59      67      7
h     49      47     65      61     14
i     55      71     80       2     94
j     19      98     63      53     27
k     56      30     48      47     39
l     38      44     18      64     56
m     34      53     74      17     72
n     13      30     17      53     68
o     50      91     91      83     53
p     78       0     13      57     76
q      3      70      3      84     79
r     10      87     60       3     48
s     52      43     36       5     71
t     38      86     94      98     42

How would we make the change in-place?

We saw in the previous unit that we could replace a single column's data using assignment and computations.  To replace the column `Fifth` by all of the values in that column multiplied by 2, we'd write:

In [76]:
df['Fifth'] = df['Fifth']*2
df

   First  Second  Third  Fourth  Fifth
a      8      24     67      87    158
b     48      10     94      52    196
c     53      66     98      14     68
d     24      15     60      58     32
e      9      93     86       2     54
f      4      31      1      13    166
g      4      91     59      67     14
h     49      47     65      61     28
i     55      71     80       2    188
j     19      98     63      53     54
k     56      30     48      47     78
l     38      44     18      64    112
m     34      53     74      17    144
n     13      30     17      53    136
o     50      91     91      83    106
p     78       0     13      57    152
q      3      70      3      84    158
r     10      87     60       3     96
s     52      43     36       5    142
t     38      86     94      98     84

But what if we wanted much finer control over what we're replacing?  It turns out we can use the ```df.loc[]``` command to change data with more precision.

In [78]:
df.loc['h':'h',:] = 1,2,3,4,5
df

   First  Second  Third  Fourth  Fifth
a      8      24     67      87    158
b     48      10     94      52    196
c     53      66     98      14     68
d     24      15     60      58     32
e      9      93     86       2     54
f      4      31      1      13    166
g      4      91     59      67     14
h      1       2      3       4      5
i     55      71     80       2    188
j     19      98     63      53     54
k     56      30     48      47     78
l     38      44     18      64    112
m     34      53     74      17    144
n     13      30     17      53    136
o     50      91     91      83    106
p     78       0     13      57    152
q      3      70      3      84    158
r     10      87     60       3     96
s     52      43     36       5    142
t     38      86     94      98     84

We can replace more than one row at a time by passing lists of lists:

In [79]:
df3 = df.copy()
df3.loc['a':'b','First':'Third'] = [[10,20,30],[99,80,79]]
df3

   First  Second  Third  Fourth  Fifth
a     10      20     30      87    158
b     99      80     79      52    196
c     53      66     98      14     68
d     24      15     60      58     32
e      9      93     86       2     54
f      4      31      1      13    166
g      4      91     59      67     14
h      1       2      3       4      5
i     55      71     80       2    188
j     19      98     63      53     54
k     56      30     48      47     78
l     38      44     18      64    112
m     34      53     74      17    144
n     13      30     17      53    136
o     50      91     91      83    106
p     78       0     13      57    152
q      3      70      3      84    158
r     10      87     60       3     96
s     52      43     36       5    142
t     38      86     94      98     84

How would we change just an individual piece of data using this method, instead of a row or column?  Let's replace row ```'j'```, column ```'Third'``` with 1000.

In [103]:
df.loc['j', 'Third'] = 1000
df

     X    Y    Z   Third
0    A  2.0  0.0     NaN
1    A  0.0  1.0     NaN
2    B  4.0  9.0     NaN
3    B  5.0  4.0     NaN
4    D  1.0  2.0     NaN
5    C  2.0  3.0     NaN
j  NaN  NaN  NaN  1000.0

Also, note that we created `df3` by specifying that it should be a *copy* of `df`:  `df3 = df.copy()`.  What would have happened if we had just defined `df3 = df` and made the changes?  Let's test with a smaller example:

In [82]:
test = pd.DataFrame(np.random.randint(0,100,size=(4, 4)),columns=list('ABCD'))
test

    A   B   C   D
0  84  95  76  33
1  58  42  22   0
2  55  98  19  53
3  68  62  50  68

In [84]:
t3 = test
t3.loc[0,:] = [0,0,0,0]
t3

    A   B   C   D
0   0   0   0   0
1  58  42  22   0
2  55  98  19  53
3  68  62  50  68

How do you think this will affect both dataframes?

In [85]:
test

    A   B   C   D
0   0   0   0   0
1  58  42  22   0
2  55  98  19  53
3  68  62  50  68

### Sorting, Grouping

Given a set of data with comparable entries (e.g.: numerical), we can sort the data in a number of ways.  We can sort along axes using the `.sort_index()` method.  In this case, we have to specify the axis (`0` refers to rows, `1` to columns) and whether to sort ascending or not.  For example, we could sort `df` by row labels in reverse order by:

In [102]:
df.sort_index(axis=0, ascending=False)

   X  Y  Z
5  C  2  3
4  D  1  2
3  B  5  4
2  B  4  9
1  A  0  1
0  A  2  0

Or we could sort by column labels in ascending order:

In [101]:
df.sort_index(axis=1,ascending=True)

   X  Y  Z
0  A  2  0
1  A  0  1
2  B  4  9
3  B  5  4
4  D  1  2
5  C  2  3

We can sort by values by using the `.sort_values()` method.  In this case, we have to tell Pandas how to sort; we can sort by a column:

In [110]:
df.sort_values(by='First',ascending=True)

   First  Second  Third  Fourth  Fifth
q      3      70      3      84     79
f      4      31      1      13     83
g      4      91     59      67      7
a      8      24     67      87     79
e      9      93     86       2     27
r     10      87     60       3     48
n     13      30     17      53     68
j     19      98     63      53     27
d     24      15     60      58     16
m     34      53     74      17     72
l     38      44     18      64     56
t     38      86     94      98     42
b     48      10     94      52     98
h     49      47     65      61     14
o     50      91     91      83     53
s     52      43     36       5     71
c     53      66     98      14     34
i     55      71     80       2     94
k     56      30     48      47     39
p     78       0     13      57     76

i.e.: it reorders the row index so that the column `First` is in ascending order by values.  

In cases where it makes sense, we can sort by more than one column.  For example:

In [111]:
test2 = pd.DataFrame({'X' : ['A', 'A', 'B','B', 'D', 'C'],'Y' : [2, 0, 4, 5, 1, 2],'Z': [0, 1, 9, 4, 2, 3]})
test2

   X  Y  Z
0  A  2  0
1  A  0  1
2  B  4  9
3  B  5  4
4  D  1  2
5  C  2  3

In [91]:
test2.sort_values(by=['X','Y'],ascending=True)

   X  Y  Z
1  A  0  1
0  A  2  0
2  B  4  9
3  B  5  4
5  C  2  3
4  D  1  2

How does this differ if we had changed the order of `X` and `Y`?  Why?

In [92]:
test2.sort_values(by=['Y','X'],ascending=True)

   X  Y  Z
1  A  0  1
4  D  1  2
0  A  2  0
5  C  2  3
2  B  4  9
3  B  5  4

How would we produce the data in `df` where `First` is bigger than 50 or `Fifth` is smaller than 50, sorted by the column `Second`?

In [113]:
c1 = df['First'] > 50
c2 = df['Fifth'] < 50
df[c1|c2].sort_values('Second')

   First  Second  Third  Fourth  Fifth
p     78       0     13      57     76
d     24      15     60      58     16
k     56      30     48      47     39
s     52      43     36       5     71
h     49      47     65      61     14
c     53      66     98      14     34
i     55      71     80       2     94
t     38      86     94      98     42
r     10      87     60       3     48
g      4      91     59      67      7
e      9      93     86       2     27
j     19      98     63      53     27

We can also group data together using `groupby`; the Pandas documentation lists this as involving one or more of the following operations:

* Splitting the data into groups based on some criteria
* Applying a function to each group independently
* Combining the results into a data structure

Using the `test2` dataframe above, we could group using the column `X`, and then find the mean of the groups (statistical functionality we'll be seeing more of later!):

In [116]:
test2.groupby('X').mean()

     Y    Z
X
A  1.0  0.5
B  4.5  6.5
C  2.0  3.0
D  1.0  2.0

We can set the `groupby` to a variable name, and call various parts of it as we need it:

In [117]:
grouped = test2.groupby('X')

It doesn't actually do any splitting until we need to, as can be seen by calling the object:

In [118]:
grouped

We can access the groups by label using `get_group()`:

In [119]:
grouped.get_group('A')

   X  Y  Z
0  A  2  0
1  A  0  1

In [120]:
grouped.get_group('C')

   X  Y  Z
5  C  2  3

We can even iterate through all of the names & groups in the object:

In [121]:
for name, group in grouped:
    print(name)
    print(group)

A
   X  Y  Z
0  A  2  0
1  A  0  1
B
   X  Y  Z
2  B  4  9
3  B  5  4
C
   X  Y  Z
5  C  2  3
D
   X  Y  Z
4  D  1  2

We can also call `describe()` on the `groupby` object to get descriptions of each group:

In [122]:
grouped.describe()

      Y                                               Z                      \
  count mean       std  min   25%  50%   75%  max count mean       std  min
X
A   2.0  1.0  1.414214  0.0  0.50  1.0  1.50  2.0   2.0  0.5  0.707107  0.0
B   2.0  4.5  0.707107  4.0  4.25  4.5  4.75  5.0   2.0  6.5  3.535534  4.0
C   1.0  2.0       NaN  2.0  2.00  2.0  2.00  2.0   1.0  3.0       NaN  3.0
D   1.0  1.0       NaN  1.0  1.00  1.0  1.00  1.0   1.0  2.0       NaN  2.0


    25%  50%   75%  max
X
A  0.25  0.5  0.75  1.0
B  5.25  6.5  7.75  9.0
C  3.00  3.0  3.00  3.0
D  2.00  2.0  2.00  2.0

(Unit 0 review question:  why are the standard deviations of groups `C` and `D` listed as `NaN`?)

What would it look like if we grouped by column `Z` instead?  Why?

### Shifting Data

We can move data up and down using the ```.shift()``` command.  If we put a positive number in as the argument, it will shift the rows *down* by that amount; negative numbers will shift the rows *up*.  New rows along the indices will be filled in with np.NaN.

In [123]:
df.shift(1)

   First  Second  Third  Fourth  Fifth
a    NaN     NaN    NaN     NaN    NaN
b    8.0    24.0   67.0    87.0   79.0
c   48.0    10.0   94.0    52.0   98.0
d   53.0    66.0   98.0    14.0   34.0
e   24.0    15.0   60.0    58.0   16.0
f    9.0    93.0   86.0     2.0   27.0
g    4.0    31.0    1.0    13.0   83.0
h    4.0    91.0   59.0    67.0    7.0
i   49.0    47.0   65.0    61.0   14.0
j   55.0    71.0   80.0     2.0   94.0
k   19.0    98.0   63.0    53.0   27.0
l   56.0    30.0   48.0    47.0   39.0
m   38.0    44.0   18.0    64.0   56.0
n   34.0    53.0   74.0    17.0   72.0
o   13.0    30.0   17.0    53.0   68.0
p   50.0    91.0   91.0    83.0   53.0
q   78.0     0.0   13.0    57.0   76.0
r    3.0    70.0    3.0    84.0   79.0
s   10.0    87.0   60.0     3.0   48.0
t   52.0    43.0   36.0     5.0   71.0

Why would we want to move our data?  Well, combined with the querying we've learned, it will allow us to compare data from one row with data from another.  This is especially useful in time-series data, where we can ask questions like "for what time periods did the price go up?", or "when is the population falling?", etc.<br>
Let's find all of the places where the data in column ```'Fifth'``` is three more than the previous entry from `df`.

In [124]:
df.head()

   First  Second  Third  Fourth  Fifth
a      8      24     67      87     79
b     48      10     94      52     98
c     53      66     98      14     34
d     24      15     60      58     16
e      9      93     86       2     27

In [125]:
df.Fifth - df.Fifth.shift(1)

a     NaN
b    19.0
c   -64.0
d   -18.0
e    11.0
f    56.0
g   -76.0
h     7.0
i    80.0
j   -67.0
k    12.0
l    17.0
m    16.0
n    -4.0
o   -15.0
p    23.0
q     3.0
r   -31.0
s    23.0
t   -29.0
Name: Fifth, dtype: float64

## Time-Series Data

One common type of data set is time-series data, which has sequential-timestamps as its index.  In this section, we'll learn about the datetime object, with focus on the following topics:
* Generating datetime ranges.
* Creating / loading data sets that have datetime indices.
* Resampling time-series data.
* Time zones conversions.

The main way to create a sequence of datetimes is to use the ```pd.date_range()``` function.  At minimum, you must specify the following arguments to create a date_range:
1. ```start```, to say when the sequence will begin.
2. ```end``` *or* ```periods```, providing either a specific end, or the number of periods from the ```start```.
3. ```freq```, the frequency of the times.  The default is ```'D'``` for calendar daily, but other options include ```'M'``` for monthly, ```'Y'``` for yearly, ```'H'``` for hourly, ```'T'``` or ```'min'``` for minutely, and ```'s'``` for secondly.
Here are two examples:

In [ ]:
dates = pd.date_range('1/1/2014', periods=28, freq='H')
dates

In [ ]:
dates2 = pd.date_range('2015-02-05', '2015-02-14', freq='D')
dates2

Let's create a dataframe now using a smaller version of the ```dates``` object above as its index.  We'll make it with three columns of random integers, representing hourly stock price changes, starting at 8:00:00 and going until 16:00 on June 1st 2014.  First, let's create that date range:

In [ ]:
dates3 = pd.date_range('2014-06-01 08:00:00','2014-06-01 16:00:00',freq='H')

In [ ]:
dft = pd.DataFrame(np.random.randint(-100,100,size=(9, 3)), columns=['Stock 1','Stock 2','Stock 3'],
                  index=dates3)
dft

We can slice along rows using the same syntax as before, feeding the timestamps as strings:

In [ ]:
dft['2014-06-03 10:00:00':'2014-06-03 13:00:00']

In [ ]:
dft.loc['2014-06-03 10:00:00':'2014-06-03 11:00:00',['Stock 1', 'Stock 3']]

### Resampling Time-Series Data

Resampling data is a method of scaling the time index, and obtaining some kind of insight about the data along the times scaled.  For example, with our stock data in ```dft```, we may wish to know what the mean price is over two-hour periods.  The syntax for resampling has changed recently in Pandas, and now has the following format: ```dataframe.resample(timeperiod).agg(instructions)```. <br>
So the average price in two-hour periods of our stocks can be obtained by:

In [ ]:
dft.resample('2H').agg('mean')

And the sum of the price changes over four hour periods is given by:

In [ ]:
dft.resample('4H').agg('sum')

One of the common methods of resampling time-series data happens in finance.  When given a list of all possible transaction prices ("tick data"), or a high-frequency set of prices (e.g.: second-data), one may want to condense the data into an overview at a longer time period.  The usual way of accomplishing this is to resample the prices to the first, maximum, minimum, and last price for each longer period (known as "open-high-low-close" format).  Let's produce a set of prices at the one-second level to start.

In [ ]:
date_seconds = pd.date_range('2017-01-01 09:30:00','2017-01-01 10:00:00',freq='S')
df_p = pd.DataFrame(np.random.randint(540,555,size=len(date_seconds)),columns=['Price'],index=date_seconds)

In [ ]:
df_p

Now, we'll follow the same resampling syntax as above to move to the one-minute level, but in the ```.arg()``` section we will provide it with a list of what we want.  Luckily, Python understands words like "first", "max", etc., in this context.

In [ ]:
df_minutes= df_p.resample('1min').agg(['first','max','min','last'])
df_minutes.head(10)

If we wanted to keep this more in line with finance conventions, we could rename the columns:

In [ ]:
df_minutes.columns = ['open','high','low','close']
df_minutes.head()

If we wanted to find the times where the price increased at the second level in ```df_p```, how would we accomplish this?

How could we find the times where the price increased at the minute level in ```df_minutes```?

Now, let's resample our minute data data again.  We'll try to find out some statistics about the open prices, by resampling to 5 minute data and finding the mean and max.

### Reading Time-Series Files

Reading in CSVs that have time-series indices is nearly the same as what we saw in the last unit, but there is an extra step.  If we use the example file "timeseries_1.csv", and tell it the index column is 0, we get the following:

In [126]:
ts = pd.read_csv('timeseries_1.csv',index_col=0)
ts.head()

                  open   high    low  close  volume
02/01/2014 8:00  748.1  748.2  746.7  746.8   39470
02/01/2014 8:01  746.9  747.1  746.8  746.8   10498
02/01/2014 8:02  746.8  747.2  746.7  747.1    7782
02/01/2014 8:03  747.2  747.8  747.1  747.6   10678
02/01/2014 8:04  747.5  747.8  747.5  747.8    3194

Now, those index elements don't look like the datetime objects we've been dealing with so far, and there's a good reason:  they're not.

This is clearly evidenced when we try to do our standard slicing:

In [127]:
ts['2014-02-01 08:00':'2014-02-01 08:03']

Empty DataFrame
Columns: [open, high, low, close, volume]
Index: []

(Though slicing with the index *as written* works)

In [128]:
ts['02/01/2014 8:00':'02/01/2014 8:03']

                  open   high    low  close  volume
02/01/2014 8:00  748.1  748.2  746.7  746.8   39470
02/01/2014 8:01  746.9  747.1  746.8  746.8   10498
02/01/2014 8:02  746.8  747.2  746.7  747.1    7782
02/01/2014 8:03  747.2  747.8  747.1  747.6   10678

If we call the index, we see:

In [129]:
ts.index

Index(['02/01/2014 8:00', '02/01/2014 8:01', '02/01/2014 8:02',
       '02/01/2014 8:03', '02/01/2014 8:04', '02/01/2014 8:05',
       '02/01/2014 8:06', '02/01/2014 8:07', '02/01/2014 8:08',
       '02/01/2014 8:09', '02/01/2014 8:10', '02/01/2014 8:11',
       '02/01/2014 8:12', '02/01/2014 8:13', '02/01/2014 8:14',
       '02/01/2014 8:15', '02/01/2014 8:16', '02/01/2014 8:17',
       '02/01/2014 8:18', '02/01/2014 8:19', '02/01/2014 8:20'],
      dtype='object')

The ```dtype``` is listed as ```object```, whereas we saw before that the ```date_range()``` function gives ```dtype='datetime64[ns]'```.  In other words, when we read the file, Pandas left the index as-is (as strings), and didn't turn them into datetime objects.  The way we fix this is that when we read in the file, we need to tell Pandas to parse anything that looks like dates:

In [130]:
ts = pd.read_csv('timeseries_1.csv',index_col=0,parse_dates=True)
ts.head()

                      open   high    low  close  volume
2014-02-01 08:00:00  748.1  748.2  746.7  746.8   39470
2014-02-01 08:01:00  746.9  747.1  746.8  746.8   10498
2014-02-01 08:02:00  746.8  747.2  746.7  747.1    7782
2014-02-01 08:03:00  747.2  747.8  747.1  747.6   10678
2014-02-01 08:04:00  747.5  747.8  747.5  747.8    3194

That looks much better!

In [131]:
ts.index

DatetimeIndex(['2014-02-01 08:00:00', '2014-02-01 08:01:00',
               '2014-02-01 08:02:00', '2014-02-01 08:03:00',
               '2014-02-01 08:04:00', '2014-02-01 08:05:00',
               '2014-02-01 08:06:00', '2014-02-01 08:07:00',
               '2014-02-01 08:08:00', '2014-02-01 08:09:00',
               '2014-02-01 08:10:00', '2014-02-01 08:11:00',
               '2014-02-01 08:12:00', '2014-02-01 08:13:00',
               '2014-02-01 08:14:00', '2014-02-01 08:15:00',
               '2014-02-01 08:16:00', '2014-02-01 08:17:00',
               '2014-02-01 08:18:00', '2014-02-01 08:19:00',
               '2014-02-01 08:20:00'],
              dtype='datetime64[ns]', freq=None)

And now our standard slicing works:

In [ ]:
ts['2014-02-01 08:00':'2014-02-01 08:03']

And since the index now contains proper datetime objects, slicing in the original format *also works*:

In [ ]:
ts['02/01/2014 8:00':'02/01/2014 8:03']

### Time Zones

Repositories of time-series data will often convert everything to Coordinated Universal Time (UTC), as a way to standardize data from different time zones.  Luckily, Pandas has a lot of excellent functionality to deal with conversions.  In fact, we can convert from one time zone to another in 2 or 3 lines of code (depending on your formatting preferences).  To begin, let's make a copy of our 9:30 to 10:00 price data.

In [ ]:
df_conv = df_p
df_conv.head()

The first step to converting is we have to specify what time zone the current data is in.  We use the ```.tz_localize()``` function for this.  Let's tell the program that our data is in UTC:

In [ ]:
df_conv.index = df_conv.index.tz_localize('UTC')
df_conv.head()

Next, we want to convert it to EST with daylight savings times accounted for.  To accomplish this, we use ```.tz_convert()``` on the index.

In [ ]:
df_conv.index = df_conv.index.tz_convert('US/Eastern')
df_conv.head()

Now our times have been converted.  If there is no ambiguity in the time zone for the data set, you can remove the time zone markers ```-05:00``` by re-localizing the time zone to ```None```.

In [ ]:
df_conv.index = df_conv.index.tz_localize(None)
df_conv.head()

### Comparing Time-Series

We learned about using the `.shift()` method to move data.  This can be very useful for time-series data for finding specific kinds of changes in the data.  If we look at our price data timeseries:

In [ ]:
ts.head()

How would we find all of the minutes that the `high` decreased compared to the previous minute?

Now how would we find all of the minutes where the open was $0.1$ or more bigger than the previous minute's low?

Time-series data has a few nuances compared to static data.  In particular cleaning missing data becomes more complicated (with more options), and validating models that are predictive on time-series data can't be done in a lot of the "normal" ways.  We will see these issues soon.

# Assignment 3

1. Consider the first dataframe example we used in this unit, ```df = pd.DataFrame(np.random.randint(0,100,size=(20, 5)), columns=['First','Second','Third','Fourth','Fifth'],index=list('abcdefghijklmnopqrst')) ```.<br>
We've seen how to add new columns, how to redefine columns, and how to redefine rows.  How would we add a new row, using the tools we've already learned?  Add a row with index ```'u'``` to df, with values ```0,1,-1,2,-2```. Then add a row with index ```'v'``` which is the sum of rows ```'b'``` and ```'d'```.
2. Read in the ```timeseries_1.csv``` file.  
   1. Find the mean of the high prices for the minutes where the volume is greater than 3000.  
   2. Suppose we have a trade signal which tells us to buy if the close price minus the open price of the previous minute is positive, and the volume of the previous minute is greater than that of the minute before it.  How many times would we buy? 
3. Consider the following dataframe of futures contract transactions:  <br> ```pc = pd.DataFrame({'Buy_or_Sell':['B','S','B','S','S','B'],'Price':[2204.0,2275.5,2250.75,2230.0,2280.75,2282.25],'Qty':[1,2,1,2,1,3]}) ```.  
    1. Create a new column called 'Value', which is Price * Qty, but is negative if the transaction is a buy, and positive if the transaction is a sell (why?).  
    2. How would we determine the money we made on these transactions? (Assume the prices given are in dollars.)
    3. Find the average (mean) price of buy transactions.

4.  The file `customer_data.csv` contains some data on the business customers of a large telecommunications firm. The columns are specified as follows:
 * INDUSTRY: the customer's industry
 * EMP: the number of employees that work at the business
 * ANNUAL_SALES: the business's annual sales
 * PROVINCE: the business headquarters
 * MOBILITY: the amount the customer has spent on mobility products (cell phones, tablets, etc.) in the last 12 months
 * INTERNET: the amount the customer has spent on Internet products in the last 12 months.
 
 Import the file and answer the following questions.
   1. The marketing department would like to target a campaign to medium sized (100-999 Employees) customers who are in either 
   2. Education or Food Services, and who currently spend less than $\$5000$ total per year on all services. Create a boolean column called INCLUDE that indicates whether the customer on that row should be included in the campaign.
   3. How many customers are in the campaign?
   4. Pandas has a function called crosstab which prints cross tabulations of categorical variables. Use the crosstab function to determine how many customers in each industry and province are included in the campaign.
   5. Create a file called customerids.csv that contains only a list of CUSTOMER_IDs to be included in the campaign.